Revit 2027 API
BuiltInFailures.ElectricalFailures.NoDistributionSystem Property
 The distribution system of [CategoryName] [Name] is set to None. Assign a distribution system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoDistributionSystem { get; }
Public Shared ReadOnly Property NoDistributionSystem As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoDistributionSystem {
	FailureDefinitionId^ get ();
}
static member NoDistributionSystem : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace